# MENGGANTI NAMA(LABEL) KOLOM PADA DATA FRAME ##

## Import Modules ###

In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame ##

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  9  3  9  4  8
1  5  6  9  9  4
2  6  8  4  7  4
3  7  7  7  2  1
4  8  7  2  7  8

# Mengganti Nama(label) 1 Kolom Pada Data Frame ##

In [4]:
df.rename(columns={'C':'Hobi '})

   A  B  Hobi   D  E
0  9  3      9  4  8
1  5  6      9  9  4
2  6  8      4  7  4
3  7  7      7  2  1
4  8  7      2  7  8

# Mengganti Nama(label) Banyak Kolom Pada Data Frame ##

In [5]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     9       3  9     4  8
1     5       6  9     9  4
2     6       8  4     7  4
3     7       7  7     2  1
4     8       7  2     7  8